#ifndef DATALOGGER_H
#define DATALOGGER_H
//=====================================================================//
/*!	@file
	@breif	データ・ロガー関係（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <stdio.h>
#include <stdlib.h>
#include "ff.h"

extern FIL *g_fd;

enum LOG_TASK {
	LOG_NONE,
	LOG_FILE_OPEN,
	LOG_FILE_WRITE,
	LOG_FILE_CLOSE,
};

#ifdef __cplusplus
extern "C" {
#endif

	//-----------------------------------------------------------------//
	/*!
		@breif	データ・ロガー・サーバー初期化
	*/
	//-----------------------------------------------------------------//
	void datalogger_init(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	データ・ロガー・サーバー・サービス
	*/
	//-----------------------------------------------------------------//
	void datalogger_service(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	データ・ロガー・サービス・リクエスト
		@param[in]	task	タスク識別
	*/
	//-----------------------------------------------------------------//
	void datalogger_request(enum LOG_TASK task);


	//-----------------------------------------------------------------//
	/*!
		@breif	ファイル・ディスクリプタを取得
		@return ファイル・ディスクリプタ
	*/
	//-----------------------------------------------------------------//
	FIL *datalogger_get_fd(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	ロギングの開始手続き
	*/
	//-----------------------------------------------------------------//
	void start_logging(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	ロギングの終了手続き
	*/
	//-----------------------------------------------------------------//
	void finsh_logging(void);


#ifdef __cplusplus
};
#endif

#endif // DATALOGGER_H
