#ifndef LCDIO_H
#define LCDIO_H
//=====================================================================//
/*!	@file
	@breif	LCD の制御ライブラリー（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//

#include <stdio.h>
#include <stdlib.h>

#ifdef __cplusplus
extern "C" {
#endif

	//-----------------------------------------------------------------//
	/*!
		@breif	LCD ハードウェアー関係の初期化など
	*/
	//-----------------------------------------------------------------//
	void lcdio_init(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	フレームバッファを転送
		@param[in]	p	フレームバッファのポインター(1024 バイト）
	*/
	//-----------------------------------------------------------------//
	void lcdio_copy(const unsigned char *p);

#ifdef __cplusplus
};
#endif

#endif // LCDIO_H
