#ifndef MENU_H
#define MENU_H
//=====================================================================//
/*!	@file
	@breif	メニュー表示関係（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <stdio.h>
#include <stdlib.h>
#include "mainloop.h"
#include "monograph.h"
#include "mobj.h"

#ifdef __cplusplus
extern "C" {
#endif

	//-----------------------------------------------------------------//
	/*!
		@breif	GPS/SD ステータス表示
	*/
	//-----------------------------------------------------------------//
	void draw_gps_sd_status(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	メニュー表示初期化
	*/
	//-----------------------------------------------------------------//
	void menu_init(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	メニュー表示メイン
	*/
	//-----------------------------------------------------------------//
	void menu_main(void);

#ifdef __cplusplus
};
#endif

#endif // MENU_H
