#ifndef MONITOR_H
#define MONITOR_H
//=====================================================================//
/*!	@file
	@breif	モニター表示関係（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <stdio.h>
#include <stdlib.h>

#ifdef __cplusplus
extern "C" {
#endif

	//-----------------------------------------------------------------//
	/*!
		@breif	モニター表示初期化
	*/
	//-----------------------------------------------------------------//
	void monitor_init(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	モニター表示メイン
	*/
	//-----------------------------------------------------------------//
	void monitor_main(void);

#ifdef __cplusplus
};
#endif

#endif // MONITOR_H
