#ifndef PSOUND_H
#define PSOUND_H
//=====================================================================//
/*!	@file
	@breif	パルス・サウンド関係（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <stdio.h>
#include <stdlib.h>

enum puls_sound_key {
	PSD_C  = 0,
	PSD_Cs = 1,
	PSD_Db = 1,
	PSD_D  = 2,
	PSD_Ds = 3,
	PSD_Eb = 3,
	PSD_E  = 4,
	PSD_F  = 5,
	PSD_Fs = 6,
	PSD_Gb = 6,
	PSD_G  = 7,
	PSD_Gs = 8,
	PSD_Ab = 8,
	PSD_A  = 9,
	PSD_As = 10,
	PSD_Bb = 10,
	PSD_B  = 11,
};

#ifdef __cplusplus
extern "C" {
#endif

	void psound_disable(void);

	//-----------------------------------------------------------------//
	/*!
		@breif	パルスサウンド初期化
	*/
	//-----------------------------------------------------------------//
	void psound_init(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	パルスサウンドサービス(1/100 で呼ぶ）
	*/
	//-----------------------------------------------------------------//
	void psound_service();


	//-----------------------------------------------------------------//
	/*!
		@breif	パルスサウンドリクエスト
		@param[in]	index	音階
		@param[in]	length	音長
	*/
	//-----------------------------------------------------------------//
	void psound_request(unsigned char index, unsigned char length);


	//-----------------------------------------------------------------//
	/*!
		@breif	パルスサウンド演奏
		@param[in]	music	音階と音長の組をテーブルにしたもの
	*/
	//-----------------------------------------------------------------//
	void psound_play_P(const prog_uint8_t *music);


	//-----------------------------------------------------------------//
	/*!
		@breif	コンペアマッチに直接値を設定する。
		@param[in]	divider	ディバイダーの設定値
		@param[in]	cmpv	コンペアマッチに設定する値
	*/
	//-----------------------------------------------------------------//
	void psound_direct(unsigned char divide, unsigned short cmpv);


	//-----------------------------------------------------------------//
	/*!
		@breif	トグル出力の周波数を設定する
		@param[in]	freq	出力周波数(Hz)下位４ビット小数点
		@return 「０」なら正常終了
	*/
	//-----------------------------------------------------------------//
	char psound_freq(unsigned long freq);


	//-----------------------------------------------------------------//
	/*!
		@breif	プリスケーラーの分周比を取得
		@return 分周比
	*/
	//-----------------------------------------------------------------//
	int get_psound_divider(void);


#ifdef __cplusplus
};
#endif

#endif // PSOUND_H
