#ifndef PULS_H
#define PULS_H
//=====================================================================//
/*!	@file
	@breif	パルス入力関係（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//

enum PULS_TASK {
	PULS_TASK_NONE,		///< パルス入力を使わない
	PULS_TASK_FRQ,		///< 周波数計測
	PULS_TASK_SPEED,	///< 速度計測
	PULS_TASK_TACHO,	///< エンジン回転数計測
};

// 最高速度リミット320 [Km/h]
#define PULS_SPD_MAX	320

// 最高回転リミット18000 [R.P.M.]
#define PULS_RPM_MAX	18000

extern uint16_t g_spd_kmh;
extern uint16_t g_eng_rpm;

#ifdef __cplusplus
extern "C" {
#endif

	//-----------------------------------------------------------------//
	/*!
		@breif	パルス・サービス・初期化
	*/
	//-----------------------------------------------------------------//
	void puls_service_init(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	パルス・サービス・メイン
	*/
	//-----------------------------------------------------------------//
	void puls_service_main(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	パルス・タスク設定
		@param[in]	task	パルス・タスク ID
	*/
	//-----------------------------------------------------------------//
	void puls_task_set(enum PULS_TASK task);


#ifdef __cplusplus
};
#endif

#endif // PULS_H
