#ifndef TITLE_H
#define TITLE_H
//=====================================================================//
/*!	@file
	@breif	タイトル表示関係（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <stdio.h>
#include <stdlib.h>

#ifdef __cplusplus
extern "C" {
#endif

	//-----------------------------------------------------------------//
	/*!
		@breif	タイトル初期化
	*/
	//-----------------------------------------------------------------//
	void title_init(void);


	//-----------------------------------------------------------------//
	/*!
		@breif	タイトル表示メイン
	*/
	//-----------------------------------------------------------------//
	void title_main(void);

#ifdef __cplusplus
};
#endif

#endif // TITLE_H
