#pragma once
//=====================================================================//
/*!	@file
	@brief	ドットマトリックス用描画クラス
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include "monograph.hpp"

namespace graphics {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	描画クラス
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	class dm_draw {

		monograph&	mg_;

	public:
		//-----------------------------------------------------------------//
		/*!
			@brief	コンストラクター
		*/
		//-----------------------------------------------------------------//
		dm_draw(monograph& mg) : mg_(mg) { } 


		//-----------------------------------------------------------------//
		/*!
			@brief	3x5 オブジェクトの描画
			@param[in]	x	X 位置
			@param[in]	y	Y 位置
			@param[in]	n	オブジェクト番号
		*/
		//-----------------------------------------------------------------//
		void draw_3x5(short x, short y, uint8_t n);


		//-----------------------------------------------------------------//
		/*!
			@brief	4x5, 5x5 オブジェクトの幅を返す
			@param[in]	n	オブジェクト番号
			@return 横幅
		*/
		//-----------------------------------------------------------------//
		uint8_t get_width_xx5(uint8_t n);


		//-----------------------------------------------------------------//
		/*!
			@brief	4x5, 5x5 オブジェクトの描画
			@param[in]	x	X 位置
			@param[in]	y	Y 位置
			@param[in]	n	オブジェクト番号
			@return 横幅
		*/
		//-----------------------------------------------------------------//
		short draw_xx5(short x, short y, uint8_t n);


		//-----------------------------------------------------------------//
		/*!
			@brief	7x10 オブジェクトの描画
			@param[in]	x	X 位置
			@param[in]	y	Y 位置
			@param[in]	n	オブジェクト番号
		*/
		//-----------------------------------------------------------------//
		void draw_7x10(short x, short y, uint8_t n);


		//-----------------------------------------------------------------//
		/*!
			@brief	icon オブジェクトの描画
			@param[in]	x	X 位置
			@param[in]	y	Y 位置
			@param[in]	n	オブジェクト番号
		*/
		//-----------------------------------------------------------------//
		void draw_icon(short x, short y, uint8_t n);

	};
}
