#pragma once
//=====================================================================//
/*!	@file
	@breif	タスクのインターフェース関係（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//

namespace app {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@breif	タスクのインターフェース・クラス
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	struct i_task {

		virtual ~i_task() { }

		virtual void init() = 0;

		virtual void service() = 0;

		virtual void destroy() = 0;

	};
}
