#pragma once
//=====================================================================//
/*!	@file
	@brief	スイッチ関係（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <stdint.h>

namespace system {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	スイッチ・クラス
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	class switch_input {

		uint8_t	level_;
		uint8_t	positive_;
		uint8_t	negative_;

		uint8_t	no_touch_;

	public:
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		/*!
			@brief	スイッチ・ビット定義
		*/
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		struct bits {
			//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
			/*!
				@brief	タイプ
			*/
			//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
			enum type {
				RIGHT_UP   = 0x02,	///< 右上ボタン
				RIGHT_DOWN = 0x01,	///< 右下ボタン
				LEFT_UP    = 0x04,	///< 左上ボタン
				LEFT_DOWN  = 0x08	///< 左下ボタン
			};
		};


		//-----------------------------------------------------------------//
		/*!
			@brief	コンストラクター
		*/
		//-----------------------------------------------------------------//
		switch_input() : level_(0), positive_(0), negative_(0), no_touch_(0) { }


		//-----------------------------------------------------------------//
		/*!
			@brief	スイッチレベルの設定と状態の生成
			@param[in]	level	スイッチレベル
		*/
		//-----------------------------------------------------------------//
		void set_level(uint8_t level) {
			positive_ =  level & ~level_;
			negative_ = ~level &  level_;
			level_ = level;
			if(level) {
				no_touch_ = 0;
			} else {
				if(no_touch_ < 255) {
					++no_touch_;
				}
			}
		}


		//-----------------------------------------------------------------//
		/*!
			@brief	レベルの取得
			@return レベル
		*/
		//-----------------------------------------------------------------//
		uint8_t get_level() const { return level_; }


		//-----------------------------------------------------------------//
		/*!
			@brief	ポジティブレベルの取得
			@return ポジティブレベル
		*/
		//-----------------------------------------------------------------//
		uint8_t get_positive() const { return positive_; }


		//-----------------------------------------------------------------//
		/*!
			@brief	ネガティブレベルの取得
			@return ネガティブレベル
		*/
		//-----------------------------------------------------------------//
		uint8_t get_negative() const { return negative_; }


		//-----------------------------------------------------------------//
		/*!
			@brief	最後にスイッチ操作が行われてからの経過検査
			@return cnt 時間以上経過していれば「true」
		*/
		//-----------------------------------------------------------------//
		bool last_touch(uint8_t cnt) const {
			return no_touch_ >= cnt;
		}
	};
}
